vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN546_DFP.pdsc
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=MCXN546.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXN546.internal_condition">
      <require condition="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MCXN546.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpuart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXN546, component.silicon_id_mcxn, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXN546, component.silicon_id_mcxn, driver.common.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXN546, component.silicon_id_mcxn.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXN546, component.silicon_id_mcxn.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXN546, component.silicon_id_mcxn.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN546, component.silicon_id_mcxn.internal_condition">
      <require condition="anyOf.device_id=MCXN546.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxn"/>
    </condition>
    <condition id="component.silicon_id_imx8.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx93.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt10xx.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1170.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1180.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxe31x.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxn.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_rw610.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_scfw.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXN546.internal_condition"/>
    </condition>
