vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN546_DFP.pdsc
    <condition id="component.wifi_bt_module.IW61X.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_murata_2ll_usd, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_murata_2ll_usd, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd, component.wifi_bt_module.config, device=MCXN546.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_murata_2ll_usd, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_murata_2ll_usd, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2dl_m2"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2dl_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2el_m2"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2el_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ll_m2"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_2ll_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_m2"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_usd"/>
    </condition>
    <condition id="component.wifi_bt_module.RW61X.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x, component.wifi_bt_module.config, device=MCXN546.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_frdm_rw61x"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rd_rw61x"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am457_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw416"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am457ma.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am510_arduino.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am510_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_am510ma.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_cm358_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_88w8987"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_cm358ma.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_nm191_usd.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_aw_nm191ma.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_frdm_rw61x.condition_id">
      <require condition="allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
