vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN546_DFP.pdsc
    <condition id="allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rw61x"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_k32w061_transceiver.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1xk_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1xk_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1zm_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_1zm_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2dl_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw61x"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2dl_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ds_m2.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ds_usd.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2el_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2el_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ll_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_murata_2ll_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_rd_rw61x.condition_id">
      <require condition="allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_ubx_jody_w2_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_ubx_jody_w5_m2.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_ubx_jody_w5_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_ubx_lily_w1_usd.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.board_ubx_maya_w1_usd.condition_id">
      <require condition="allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.bt_only_fw.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.config.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MCXN546.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_88w8987"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw416"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw61x"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rw61x"/>
    </condition>
