vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN546_DFP.pdsc
    <condition id="driver.dbi_flexio_smartdma.condition_id">
      <require condition="allOf.driver.dbi, driver.flexio_mculcd, driver.flexio_mculcd_smartdma, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, driver.flexio_mculcd, driver.flexio_mculcd_smartdma, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd_smartdma"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dbi.condition_id">
      <require condition="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-ssd1963.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device_id=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device_id.MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.eim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.erm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.evtg.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexcan, driver.edma4, device=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexcan, driver.edma4, device=MCXN546.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXN546.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma4.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXN546.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MCXN546.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MCXN546.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXN546.internal_condition"/>
    </condition>
