vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN546_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXN546_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXN546_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core0_flash.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core0_flash_ns.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core0_flash_s.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core0_ram.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core1_flash.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core1_ram.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/arm/MCXN546_cm33_core1_ram_s.scf" version="1.0.0" projectpath="MCXN546/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core0_flash.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core0_flash_ns.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core0_flash_s.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core0_ram.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core1_flash.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core1_ram.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/gcc/MCXN546_cm33_core1_ram_s.ld" version="1.0.0" projectpath="MCXN546/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core0_flash.icf" version="1.0.0" projectpath="MCXN546/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core0_flash_ns.icf" version="1.0.0" projectpath="MCXN546/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core0_flash_s.icf" version="1.0.0" projectpath="MCXN546/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core0_ram.icf" version="1.0.0" projectpath="MCXN546/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core1_flash.icf" version="1.0.0" projectpath="MCXN546/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core1_ram.icf" version="1.0.0" projectpath="MCXN546/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN546.condition_id" category="linkerScript" attr="config" name="devices/MCXN546/iar/MCXN546_cm33_core1_ram_s.icf" version="1.0.0" projectpath="MCXN546/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXN546" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXN546</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN546/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN546/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN546/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN546/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN546/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN546/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN546/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN546/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN546/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXN546_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN546/iar/startup_MCXN546_cm33_core0.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN546/gcc/startup_MCXN546_cm33_core0.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN546/arm/startup_MCXN546_cm33_core0.S" version="1.0.0" projectpath="startup/arm"/>
        <file condition="allOf.toolchains=iar, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN546/iar/startup_MCXN546_cm33_core1.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN546/gcc/startup_MCXN546_cm33_core1.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN546/arm/startup_MCXN546_cm33_core1.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN546_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXN546_system</description>
      <files>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" name="devices/MCXN546/system_MCXN546_cm33_core0.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN546/system_MCXN546_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" name="devices/MCXN546/system_MCXN546_cm33_core1.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN546/system_MCXN546_cm33_core1.h" projectpath="device"/>
        <file category="include" name="devices/MCXN546/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN546/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN546/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN546/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
